SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/STM32F746/LCDConf.c
#define DMA2D_BASE                 (AHB1PERIPH_BASE + 0xB000)
#define DMA2D                      ((DMA2D_T *)DMA2D_BASE)

#define GPIOA_BASE                 (AHB1PERIPH_BASE + 0x0000)
#define GPIOB_BASE                 (AHB1PERIPH_BASE + 0x0400)
#define GPIOC_BASE                 (AHB1PERIPH_BASE + 0x0800)
#define GPIOD_BASE                 (AHB1PERIPH_BASE + 0x0C00)
#define GPIOE_BASE                 (AHB1PERIPH_BASE + 0x1000)
#define GPIOF_BASE                 (AHB1PERIPH_BASE + 0x1400)
#define GPIOG_BASE                 (AHB1PERIPH_BASE + 0x1800)
#define GPIOH_BASE                 (AHB1PERIPH_BASE + 0x1C00)
#define GPIOI_BASE                 (AHB1PERIPH_BASE + 0x2000)
#define GPIOJ_BASE                 (AHB1PERIPH_BASE + 0x2400)
#define GPIOK_BASE                 (AHB1PERIPH_BASE + 0x2800)

#define GPIOA                      ((GPIO_T *) GPIOA_BASE)
#define GPIOC                      ((GPIO_T *) GPIOC_BASE)
#define GPIOE                      ((GPIO_T *) GPIOE_BASE)
#define GPIOG                      ((GPIO_T *) GPIOG_BASE)
#define GPIOI                      ((GPIO_T *) GPIOI_BASE)
#define GPIOJ                      ((GPIO_T *) GPIOJ_BASE)
#define GPIOK                      ((GPIO_T *) GPIOK_BASE)

#define GPIO_Pin_0                 ((U16)0x0001)
#define GPIO_Pin_1                 ((U16)0x0002)
#define GPIO_Pin_2                 ((U16)0x0004)
#define GPIO_Pin_3                 ((U16)0x0008)
#define GPIO_Pin_4                 ((U16)0x0010)
#define GPIO_Pin_5                 ((U16)0x0020)
#define GPIO_Pin_6                 ((U16)0x0040)
#define GPIO_Pin_7                 ((U16)0x0080)
#define GPIO_Pin_8                 ((U16)0x0100)
#define GPIO_Pin_9                 ((U16)0x0200)
#define GPIO_Pin_10                ((U16)0x0400)
#define GPIO_Pin_11                ((U16)0x0800)
#define GPIO_Pin_12                ((U16)0x1000)
#define GPIO_Pin_13                ((U16)0x2000)
#define GPIO_Pin_14                ((U16)0x4000)
#define GPIO_Pin_15                ((U16)0x8000)
#define GPIO_Pin_All               ((U16)0xFFFF)

#define GPIO_PinSource0            ((U8)0x00)
#define GPIO_PinSource1            ((U8)0x01)
#define GPIO_PinSource2            ((U8)0x02)
#define GPIO_PinSource3            ((U8)0x03)
#define GPIO_PinSource4            ((U8)0x04)
#define GPIO_PinSource5            ((U8)0x05)
#define GPIO_PinSource6            ((U8)0x06)
#define GPIO_PinSource7            ((U8)0x07)
#define GPIO_PinSource8            ((U8)0x08)
#define GPIO_PinSource9            ((U8)0x09)
#define GPIO_PinSource10           ((U8)0x0A)
#define GPIO_PinSource11           ((U8)0x0B)
#define GPIO_PinSource12           ((U8)0x0C)
#define GPIO_PinSource13           ((U8)0x0D)
#define GPIO_PinSource14           ((U8)0x0E)
#define GPIO_PinSource15           ((U8)0x0F)

#define GPIO_MODER_MODER0          ((U32)0x00000003)
#define GPIO_OSPEEDER_OSPEEDR0     ((U32)0x00000003)
#define GPIO_OTYPER_OT_0           ((U32)0x00000001)
#define GPIO_PUPDR_PUPDR0          ((U32)0x00000003)

#define RCC_AHB1Periph_GPIOA       ((U32)0x00000001)
#define RCC_AHB1Periph_GPIOB       ((U32)0x00000002)
#define RCC_AHB1Periph_GPIOC       ((U32)0x00000004)
#define RCC_AHB1Periph_GPIOD       ((U32)0x00000008)
#define RCC_AHB1Periph_GPIOE       ((U32)0x00000010)
#define RCC_AHB1Periph_GPIOF       ((U32)0x00000020)
#define RCC_AHB1Periph_GPIOG       ((U32)0x00000040)
#define RCC_AHB1Periph_GPIOH       ((U32)0x00000080)
#define RCC_AHB1Periph_GPIOI       ((U32)0x00000100)
#define RCC_AHB1Periph_GPIOJ       ((U32)0x00000200)
#define RCC_AHB1Periph_GPIOK       ((U32)0x00000400)
#define RCC_AHB1Periph_DMA2D       ((U32)0x00800000)
#define RCC_APB2Periph_LTDC        ((U32)0x04000000)

#define RCC_DCKCFGR_PLLSAIDIVR     ((U32)0x00030000)

#define RCC_PLLSAIDivR_Div8        ((U32)0x00020000)

#define RCC_FLAG_PLLSAIRDY         ((U8)0x3D)

#define GPIO_AF9_LTDC                ((U8)0x09)                   // LCD-TFT Alternate Function 9  mapping
#define GPIO_AF14_LTDC               ((U8)0x0E)                   // LCD-TFT Alternate Function 14 mapping

// Bit definition for LTDC_SSCR register
#define LTDC_SSCR_VSH              ((U32)0x000007FF)              // Vertical Synchronization Height
#define LTDC_SSCR_HSW              ((U32)0x0FFF0000)              // Horizontal Synchronization Width

// Bit definition for LTDC_BPCR register
#define LTDC_BPCR_AVBP             ((U32)0x000007FF)              // Accumulated Vertical Back Porch
#define LTDC_BPCR_AHBP             ((U32)0x0FFF0000)              // Accumulated Horizontal Back Porch

// Bit definition for LTDC_AWCR register
#define LTDC_AWCR_AAH              ((U32)0x000007FF)              // Accumulated Active heigh
#define LTDC_AWCR_AAW              ((U32)0x0FFF0000)              // Accumulated Active Width

// Bit definition for LTDC_TWCR register
#define LTDC_TWCR_TOTALH           ((U32)0x000007FF)              // Total Heigh
#define LTDC_TWCR_TOTALW           ((U32)0x0FFF0000)              // Total Width

// Bit definition for LTDC_GCR register
#define LTDC_GCR_LTDCEN            ((U32)0x00000001)              // LCD-TFT controller enable bit
#define LTDC_GCR_DBW               ((U32)0x00000070)              // Dither Blue Width
#define LTDC_GCR_DGW               ((U32)0x00000700)              // Dither Green Width
#define LTDC_GCR_DRW               ((U32)0x00007000)              // Dither Red Width
#define LTDC_GCR_DTEN              ((U32)0x00010000)              // Dither Enable
#define LTDC_GCR_PCPOL             ((U32)0x10000000)              // Pixel Clock Polarity
#define LTDC_GCR_DEPOL             ((U32)0x20000000)              // Data Enable Polarity
#define LTDC_GCR_VSPOL             ((U32)0x40000000)              // Vertical Synchronization Polarity
#define LTDC_GCR_HSPOL             ((U32)0x80000000)              // Horizontal Synchronization Polarity

// Bit definition for LTDC_SRCR register
#define LTDC_SRCR_IMR              ((U32)0x00000001)              // Immediate Reload
#define LTDC_SRCR_VBR              ((U32)0x00000002)              // Vertical Blanking Reload

// Bit definition for LTDC_BCCR register
#define LTDC_BCCR_BCBLUE           ((U32)0x000000FF)              // Background Blue value
#define LTDC_BCCR_BCGREEN          ((U32)0x0000FF00)              // Background Green value
#define LTDC_BCCR_BCRED            ((U32)0x00FF0000)              // Background Red value

// Bit definition for LTDC_IER register
#define LTDC_IER_LIE               ((U32)0x00000001)              // Line Interrupt Enable
#define LTDC_IER_FUIE              ((U32)0x00000002)              // FIFO Underrun Interrupt Enable
#define LTDC_IER_TERRIE            ((U32)0x00000004)              // Transfer Error Interrupt Enable
#define LTDC_IER_RRIE              ((U32)0x00000008)              // Register Reload interrupt enable

// Bit definition for LTDC_ISR register
#define LTDC_ISR_LIF               ((U32)0x00000001)              // Line Interrupt Flag
#define LTDC_ISR_FUIF              ((U32)0x00000002)              // FIFO Underrun Interrupt Flag
#define LTDC_ISR_TERRIF            ((U32)0x00000004)              // Transfer Error Interrupt Flag
#define LTDC_ISR_RRIF              ((U32)0x00000008)              // Register Reload interrupt Flag

// Bit definition for LTDC_ICR register
#define LTDC_ICR_CLIF              ((U32)0x00000001)              // Clears the Line Interrupt Flag
#define LTDC_ICR_CFUIF             ((U32)0x00000002)              // Clears the FIFO Underrun Interrupt Flag
#define LTDC_ICR_CTERRIF           ((U32)0x00000004)              // Clears the Transfer Error Interrupt Flag
#define LTDC_ICR_CRRIF             ((U32)0x00000008)              // Clears Register Reload interrupt Flag

// Bit definition for LTDC_LIPCR register
#define LTDC_LIPCR_LIPOS           ((U32)0x000007FF)              // Line Interrupt Position

// Bit definition for LTDC_CPSR register
#define LTDC_CPSR_CYPOS            ((U32)0x0000FFFF)              // Current Y Position
#define LTDC_CPSR_CXPOS            ((U32)0xFFFF0000)              // Current X Position

// Bit definition for LTDC_CDSR register
#define LTDC_CDSR_VDES             ((U32)0x00000001)              // Vertical Data Enable Status
#define LTDC_CDSR_HDES             ((U32)0x00000002)              // Horizontal Data Enable Status
#define LTDC_CDSR_VSYNCS           ((U32)0x00000004)              // Vertical Synchronization Status
#define LTDC_CDSR_HSYNCS           ((U32)0x00000008)              // Horizontal Synchronization Status

// Bit definition for LTDC_LxCR register
#define LTDC_LxCR_LEN              ((U32)0x00000001)              // Layer Enable
#define LTDC_LxCR_COLKEN           ((U32)0x00000002)              // Color Keying Enable
#define LTDC_LxCR_CLUTEN           ((U32)0x00000010)              // Color Lockup Table Enable

// Bit definition for LTDC_LxWHPCR register
#define LTDC_LxWHPCR_WHSTPOS       ((U32)0x00000FFF)              // Window Horizontal Start Position
#define LTDC_LxWHPCR_WHSPPOS       ((U32)0xFFFF0000)              // Window Horizontal Stop Position

// Bit definition for LTDC_LxWVPCR register
#define LTDC_LxWVPCR_WVSTPOS       ((U32)0x00000FFF)              // Window Vertical Start Position
#define LTDC_LxWVPCR_WVSPPOS       ((U32)0xFFFF0000)              // Window Vertical Stop Position

