SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/STM32F746/LCDConf.c
// Bit definition for LTDC_LxCKCR register
#define LTDC_LxCKCR_CKBLUE         ((U32)0x000000FF)              // Color Key Blue value
#define LTDC_LxCKCR_CKGREEN        ((U32)0x0000FF00)              // Color Key Green value
#define LTDC_LxCKCR_CKRED          ((U32)0x00FF0000)              // Color Key Red value

// Bit definition for LTDC_LxPFCR register
#define LTDC_LxPFCR_PF             ((U32)0x00000007)              // Pixel Format

// Bit definition for LTDC_LxCACR register
#define LTDC_LxCACR_CONSTA         ((U32)0x000000FF)              // Constant Alpha

// Bit definition for LTDC_LxDCCR register
#define LTDC_LxDCCR_DCBLUE         ((U32)0x000000FF)              // Default Color Blue
#define LTDC_LxDCCR_DCGREEN        ((U32)0x0000FF00)              // Default Color Green
#define LTDC_LxDCCR_DCRED          ((U32)0x00FF0000)              // Default Color Red
#define LTDC_LxDCCR_DCALPHA        ((U32)0xFF000000)              // Default Color Alpha

// Bit definition for LTDC_LxBFCR register
#define LTDC_LxBFCR_BF2            ((U32)0x00000007)              // Blending Factor 2
#define LTDC_LxBFCR_BF1            ((U32)0x00000700)              // Blending Factor 1

// Bit definition for LTDC_LxCFBAR register
#define LTDC_LxCFBAR_CFBADD        ((U32)0xFFFFFFFF)              // Color Frame Buffer Start Address

// Bit definition for LTDC_LxCFBLR register
#define LTDC_LxCFBLR_CFBLL         ((U32)0x00001FFF)              // Color Frame Buffer Line Length
#define LTDC_LxCFBLR_CFBP          ((U32)0x1FFF0000)              // Color Frame Buffer Pitch in bytes

// Bit definition for LTDC_LxCFBLNR register
#define LTDC_LxCFBLNR_CFBLNBR      ((U32)0x000007FF)              // Frame Buffer Line Number

// Bit definition for LTDC_LxCLUTWR register
#define LTDC_LxCLUTWR_BLUE         ((U32)0x000000FF)              // Blue value
#define LTDC_LxCLUTWR_GREEN        ((U32)0x0000FF00)              // Green value
#define LTDC_LxCLUTWR_RED          ((U32)0x00FF0000)              // Red value
#define LTDC_LxCLUTWR_CLUTADD      ((U32)0xFF000000)              // CLUT address

// Bit definition for DMA2D_ISR register
#define DMA2D_ISR_TEIF             ((U32)0x00000001)              // Transfer Error Interrupt Flag
#define DMA2D_ISR_TCIF             ((U32)0x00000002)              // Transfer Complete Interrupt Flag
#define DMA2D_ISR_TWIF             ((U32)0x00000004)              // Transfer Watermark Interrupt Flag
#define DMA2D_ISR_CAEIF            ((U32)0x00000008)              // CLUT Access Error Interrupt Flag
#define DMA2D_ISR_CTCIF            ((U32)0x00000010)              // CLUT Transfer Complete Interrupt Flag
#define DMA2D_ISR_CEIF             ((U32)0x00000020)              // Configuration Error Interrupt Flag

// Bit definition for DMA2D_IFSR register
#define DMA2D_IFSR_CTEIF           ((U32)0x00000001)              // Clears Transfer Error Interrupt Flag
#define DMA2D_IFSR_CTCIF           ((U32)0x00000002)              // Clears Transfer Complete Interrupt Flag
#define DMA2D_IFSR_CTWIF           ((U32)0x00000004)              // Clears Transfer Watermark Interrupt Flag
#define DMA2D_IFSR_CCAEIF          ((U32)0x00000008)              // Clears CLUT Access Error Interrupt Flag
#define DMA2D_IFSR_CCTCIF          ((U32)0x00000010)              // Clears CLUT Transfer Complete Interrupt Flag
#define DMA2D_IFSR_CCEIF           ((U32)0x00000020)              // Clears Configuration Error Interrupt Flag

// Bit definition for DMA2D_CR register
#define DMA2D_CR_START             ((U32)0x00000001)              // Start transfer
#define DMA2D_CR_SUSP              ((U32)0x00000002)              // Suspend transfer
#define DMA2D_CR_ABORT             ((U32)0x00000004)              // Abort transfer
#define DMA2D_CR_TEIE              ((U32)0x00000100)              // Transfer Error Interrupt Enable
#define DMA2D_CR_TCIE              ((U32)0x00000200)              // Transfer Complete Interrupt Enable
#define DMA2D_CR_TWIE              ((U32)0x00000400)              // Transfer Watermark Interrupt Enable
#define DMA2D_CR_CAEIE             ((U32)0x00000800)              // CLUT Access Error Interrupt Enable
#define DMA2D_CR_CTCIE             ((U32)0x00001000)              // CLUT Transfer Complete Interrupt Enable
#define DMA2D_CR_CEIE              ((U32)0x00002000)              // Configuration Error Interrupt Enable
#define DMA2D_CR_MODE              ((U32)0x00030000)              // DMA2D Mode

// Common LTDC
#define GCR_MASK                   ((U32)0x0FFE888F)              // LTDC GCR Mask

#define LTDC_Pixelformat_ARGB8888  ((U32)0x00000000)
#define LTDC_Pixelformat_RGB888    ((U32)0x00000001)
#define LTDC_Pixelformat_RGB565    ((U32)0x00000002)
#define LTDC_Pixelformat_ARGB1555  ((U32)0x00000003)
#define LTDC_Pixelformat_ARGB4444  ((U32)0x00000004)
#define LTDC_Pixelformat_L8        ((U32)0x00000005)
#define LTDC_Pixelformat_AL44      ((U32)0x00000006)
#define LTDC_Pixelformat_AL88      ((U32)0x00000007)
#define LTDC_Pixelformat_L4        ((U32)0x00000008)

#define LTDC_BlendingFactor1_CA    ((U32)0x00000400)
#define LTDC_BlendingFactor2_CA    ((U32)0x00000005)
#define LTDC_BlendingFactor1_PAxCA ((U32)0x00000600)
#define LTDC_BlendingFactor2_PAxCA ((U32)0x00000007)

#define LTDC_PCPolarity_IPC        ((U32)0x00000000)              // Input pixel clock.
#define LTDC_PCPolarity_IIPC       LTDC_GCR_PCPOL                 // Inverted input pixel clock.

#define LTDC_DEPolarity_AL         ((U32)0x00000000)              // Data Enable, is active low.
#define LTDC_DEPolarity_AH         LTDC_GCR_DEPOL                 // Data Enable, is active high.

#define LTDC_VSPolarity_AL         ((U32)0x00000000)              // Vertical Synchronization is active low.
#define LTDC_VSPolarity_AH         LTDC_GCR_VSPOL                 // Vertical Synchronization is active high.

#define LTDC_HSPolarity_AL         ((U32)0x00000000)              // Horizontal Synchronization is active low.
#define LTDC_HSPolarity_AH         LTDC_GCR_HSPOL                 // Horizontal Synchronization is active high.

// Common
#define __NVIC_PRIO_BITS           4                              // STM32F4XX uses 4 Bits for the Priority Levels

#define LTDC_IRQn                  88                             // LTDC global Interrupt
#define DMA2D_IRQn                 90                             // DMA2D global Interrupt

#define PLLSAION_BitNumber         0x1C

#define PERIPH_BB_BASE             ((U32)0x42000000)              // Peripheral base address in the bit-band region

